glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F3x0_DFP.pdsc
        <!-- *************************  Device 'GD32F330F8'  ***************************** -->
        <device Dname="GD32F330F8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F330G4'  ***************************** -->
        <device Dname="GD32F330G4">
         <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F330G6'  ***************************** -->
        <device Dname="GD32F330G6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F330G8'  ***************************** -->
        <device Dname="GD32F330G8">
           <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F330K4'  ***************************** -->
        <device Dname="GD32F330K4">
         <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F330K6'  ***************************** -->
        <device Dname="GD32F330K6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F330K8'  ***************************** -->
        <device Dname="GD32F330K8">
           <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F330C4'  ***************************** -->
        <device Dname="GD32F330C4">
         <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F330C6'  ***************************** -->
        <device Dname="GD32F330C6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F330C8'  ***************************** -->
        <device Dname="GD32F330C8">
           <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F330CB'  ***************************** -->
        <device Dname="GD32F330CB">
         <memory    id="IROM1"                   start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x20000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F330R8'  ***************************** -->
        <device Dname="GD32F330R8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F330RB'  ***************************** -->
        <device Dname="GD32F330RB">
           <memory    id="IROM1"                   start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x20000" default="1"/>
        </device>

      </subFamily>

