glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F3x0_DFP.pdsc
<!-- ************************  Subfamily 'GD32F350'  **************************** -->
      <subFamily DsubFamily="GD32F350">
        <processor Dclock="108000000"/>
         <compile header="Device/Include/gd32f3x0.h" define="GD32F350"/>
        <debug svd="SVD/GD32F3x0.svd"/>
        <description>
        GD32F350 - ARM Cortex-M4 Core
          Frequency up to 108 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 16KB to 128 KB
          SRAM size is 4 KB with HW parity checking
          3KB ISP loader ROM
        </description>
       <feature type="USBOTG"          n="1"                                         name="High-Speed/Full-Speed USB OTG with PHY"/>
      <feature type="I2S"                  n="1"                                          name="I2S Interface"  />
      <feature type="DAC"               n="1"             m="10"                name="DAC"/>
      <feature type="Timer"             n="1"              m="16"               name="Basic Timer"/> 
      <feature type="Other"              n="2"                                         name="My other Interface"/> 

        <!-- *************************  Device 'GD32F350G4'  ***************************** -->
        <device Dname="GD32F350G4">
         <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F350G6'  ***************************** -->
        <device Dname="GD32F350G6">
         <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01800" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F350G8'  ***************************** -->
        <device Dname="GD32F350G8">
         <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F350K4'  ***************************** -->
        <device Dname="GD32F350K4">
         <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F350K6'  ***************************** -->
        <device Dname="GD32F350K6">
         <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01800" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F350K8'  ***************************** -->
        <device Dname="GD32F350K8">
         <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F350C4'  ***************************** -->
        <device Dname="GD32F350C4">
         <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F350C6'  ***************************** -->
        <device Dname="GD32F350C6">
         <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01800" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F350C8'  ***************************** -->
        <device Dname="GD32F350C8">
         <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F350CB'  ***************************** -->
        <device Dname="GD32F350CB">
         <memory    id="IROM1"                   start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x20000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F350R4'  ***************************** -->
        <device Dname="GD32F350R4">
         <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>
      
