glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F3x0_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="FMC" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_fmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_fmc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_gpio.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="SYSCFG" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>System Configuration (SYSCFG) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SYSCFG
        </RTE_Components_h>
        <files>
          <!-- SYSCFG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_syscfg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_syscfg.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_i2c.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="FWDGT" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Free Watchdog Timer (FWDGT) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- IWDG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_fwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_fwdgt.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="PMU" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PWR flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_pmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_pmu.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="RCU" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_rcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_rcu.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="RTC" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_rtc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="SPI_I2S" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_spi.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="TIMER" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>TIMER driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_timer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_timer.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="USART" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_usart.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="WWDGT" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_wwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_wwdgt.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="GD32F3x0 CMSIS">
      <description>MISC driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_misc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="TSI" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Touch Sensing Interface (TSI) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TSI
        </RTE_Components_h>
        <files>
          <!-- TSI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_tsi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_tsi.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="CEC" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Consumer Electronics Control (CEC) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CEC
        </RTE_Components_h>
        <files>
          <!-- CEC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_cec.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_cec.c" attr="config" version="1.0.0" />
        </files>
    </component>
 
